[
    {
        "numDay": 1,
        "numReports": 1,
        "configuration": 
        {
            "shouldSkipQuiz": true,
            "hasSnippets": false,
            "selectSnippets": false,
            "selectSnippetStages": false,
            "groomingProbability": 0.75,
            "minAgeGroomer": 40,
            "maxAgeGroomer": 60
        },
        "narrationNodes": 
        [
            {"text": "¡Bienvenido a las oficinas de Instapic! Eres el nuevo becario, ¿correcto?", "goTo": -1, 
                "options":[
                    {"text": "Sí, soy yo.", "goTo": 2}, 
                    {"text": "No sé de qué me hablas.", "goTo": 3}
                ]
            },
            {"text": "¡Perfecto! Déjame que te explique las tareas que vas a llevar a cabo.", "goTo": 4},
            {"text": "¿En serio? Pues qué mala suerte, te va a tocar trabajar igualmente ^^. Déjame que te explique las tareas que vas a llevar a cabo.", "goTo": 4},
            {"text": "Básicamente serás algo parecido a un moderador de chats.", "goTo": 5},
            {"text": "A lo largo del día te llegarán informes que han sido marcados como posibles casos de grooming, y tendrás que decidir si efectivamente lo son, o si son chats normales.", "goTo": 6},
            {"text": "Espera... ¿Sabes siquiera lo que significa el término grooming?", "goTo": -1, 
                "options":[
                    {"text": "Claro que sí.", "goTo": 7}, 
                    {"text": "No, no lo sé.", "goTo": 10}
                ]
            },
            {"text": "Ajá. ¿Y qué significa?", "goTo": -1, 
                "options":[
                    {"text": "Es el proceso por el cual un adulto establece una relación con un menor para abusar de este.", "goTo": 8}, 
                    {"text": "Se da cuando una persona percibe falsamente a su ídolo como alguien cercano a ella.", "goTo": 9},
                    {"text": "Vale, lo admito. No lo sé.", "goTo": 10}
                ]
            },
            {"text": "¡Correcto! Y cuando se da en las redes, se le llama online grooming.", "goTo": 12},
            {"text": "¡Incorrecto! Eso es lo que se llama una relación parasocial. A veces se puede dar en casos de grooming, pero no es grooming en sí mismo.", "goTo": 11},
            {"text": "No pasa nada, ahora te lo explico.", "goTo": 11},
            {"text": "El grooming es el proceso por el cual un adulto establece una relación con un menor para abusar de este. Si se da en las redes, se categoriza como online grooming.", "goTo": 12},
            {"text": "El grooming puede ser más o menos largo, llegando a durar incluso años.", "goTo": 13},
            {"text": "Creo que tienes suficiente información por ahora, sigamos con la explicación de tu trabajo.", "goTo": 14},
            {"text": "Cada informe contendrá información diversa sobre el chat entre dos usuarios.", "goTo": 15},
            {"text": "Como es tu primer día, comenzaremos con informes simplificados. Estos contienen solo la edad de las dos personas, la primera el posible groomer (acosador), y el tiempo que llevan de amigos. Te tendrás que basar en la edad para decidir.", "goTo": 16},
            {"text": "Cada vez que clasifiques un informe correctamente obtendrás puntos, que nos servirán para ver cómo te desenvuelves con tus tareas.", "goTo": 17},
            {"text": "Al final del día volveré y te haré una pregunta relacionada con lo que has visto ese día.", "goTo": 18},
            {"text": "Te has quedado con todo, ¿o necesitas que te lo repita?", "goTo": -1, 
            "options":[
                {"text": "Lo he entendido todo.", "goTo": 19}, 
                {"text": "Repíte, por favor.", "goTo": 20}
            ]
            },
            {"text": "¡Pues a trabajar se ha dicho! Ahí van tus primeros informes, a ver qué tal. Cuando acabes comentamos.", "goTo": -1},
            {"text": "Tu trabajo consiste en revisar informes de chats y decidir si son casos de grooming o no.", "goTo": 14}
        ]
    },
    {
        "numDay": 1,
        "numReports": 2,
        "configuration": 
        {
            "shouldSkipQuiz": true,
            "hasSnippets": false,
            "selectSnippets": false,
            "selectSnippetStages": false,
            "groomingProbability": 1.0,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 30
        },
        "narrationNodes": 
        [
            {"text": "¿Bueno, cómo lo vas llevando de momento?", "goTo": -1, 
                "options":[
                    {"text": "Ha sido pan comdio, era evidente.", "goTo": 2}
                ]
            },
            {"text": "¿Sí? A ver cómo te desenvuelves con los siguientes entonces.", "goTo": -1}
        ]
    },
    {
        "numDay": 1,
        "numReports": 0,
        "configuration": 
        {
            "shouldSkipQuiz": false,
            "hasSnippets": false,
            "selectSnippets": false,
            "selectSnippetStages": false,
            "groomingProbability": 1.0,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 35
        },
        "narrationNodes": 
        [
            {"text": "¿Qué te han parecido estos?", "goTo": -1, 
                "options":[
                    {"text": "Todo bien de momento.", "goTo": 2},
                    {"text": "No lo entiendo. Eran muy jóvenes, podrían ser amigos perfectamente.", "goTo": 3}
                ]
            },
            {"text": "Genial!", "goTo": 3},
            {"text": "Obviamente, sé que no se puede juzgar su relación solamente en la edad de las personas.", "goTo": 4},
            {"text": "Aun así, es importante saber que no todos los groomers son personas 'mayores'.", "goTo": 5},
            {"text": "Muchas campañas lo pintan así, pero no es verdad. Los acosadores tampoco suelen ser agresivos, o raptar a niños como dicen muchos.", "goTo": 6},
            {"text": "En fin, creo que te he dado suficiente información por hoy.", "goTo": -1, 
            "options":[
                {"text": "Pues ale, ¡hasta mañana!", "goTo": 7}
            ]
            },
            {"text": "¡Espera! Aún no hemos acabado.", "goTo": -1, 
                "options":[
                    {"text": "¿Qué falta ahora?", "goTo": 8}
                ]
            },
            {"text": "Falta el quiz diario. No te preocupes, es súper rápido. Si aciertas, incrementaré tu multiplicador de puntos, así ganarás más.", "goTo": -1, 
                "options":[
                    {"text": "¿Y si fallo?", "goTo": 9}
                ]
            },
            {"text": "Como es tu primer día, no pasará nada. Pero a partir de mañana, si fallas disminuiré tu multiplicador. Listo?", "goTo": -1, 
                "options":[
                    {"text": "Sí. ¡Vamos!", "goTo": -1}
                ]
            }
        ]
    },
    {
        "numDay": 2,
        "numReports": 3,
        "configuration": 
        {
            "shouldSkipQuiz": false,
            "hasSnippets": true,
            "selectSnippets": false,
            "selectSnippetStages": false,
            "groomingProbability": 0.6,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 65
        },
        "narrationNodes": 
        [
            {"text": "Buenos días. ¿Preparado para otro día de trabajo?", "goTo": -1, 
                "options":[
                    {"text": "Listo.", "goTo": 2}
                ]
            },
            {"text": "Perfecto! Hoy los informes serán un poco más complejos. Además de los perfiles de los usuarios tendrás también una serie de extractos de su chat con los que guiar tu decisión.", "goTo": 3},
            {"text": "¿Entendido?", "goTo": -1, 
                "options":[
                    {"text": "Espera. ¿Qué signos debería buscar en los chats?", "goTo": 4}
                ]
            },
            {"text": "Bueno, cada acosador es diferente, pero la mayoría se pueden encasillar en 3 grupos.", "goTo": 5},
            {"text": "El primero, el 'buscador de intimidad', es el groomer que realmente quiere entablar una relación con el menor, por lo que mensajes demasiado cariñosos lo delatan.", "goTo": 6},
            {"text": "El segundo es el acosador 'hipersexualizado', que insiste mucho en el tema sexual, ya sea fotos, mensajes subidos de tono... Como aún eres nuevo, no te pondremos a cargo de informes de ese tipo, no te preocupes.", "goTo": 7},
            {"text": "Finalmente, está el groomer 'polivalente', que cambia su estrategia según la víctima.", "goTo": 8},
            {"text": "Aunque haya 3 tipos, todos tienen en común que al principio intentan sacarle la máxima información al menor sobre cosas como su situación en casa, en la escuela, etc. Eso les dice si son vulnerables o no.", "goTo": 9},
            {"text": "También hay mucho énfasis en el secretismo, en caso de que haya relación.", "goTo": 10},
            {"text": "Pero bueno, de esto te dire más próximamente, de momento con esto ya creo que es suficiente.", "goTo": 11},
            {"text": "Todo bien?", "goTo": -1, 
                "options":[
                    {"text": "Sí, estoy listo para comenzar el día.", "goTo": 14},
                    {"text": "No, la verdad. Es mucha información. ¿Me lo podrías repetir, por favor?", "goTo": 12}
                ]
            },
            {"text": "¡Claro! No te preocupes, te lo explico de nuevo.", "goTo": 13},
            {"text": "Si tuvieramos que agrupar a los acosadores en grupos, habría 3 prominentes:", "goTo": 5},
            {"text": "Pues allá vas. Esta vez, cuando acabes con los informes pasaremos directamente al quiz diario. ¡Mucha suerte!", "goTo": -1}
        ]   
    },
    {
        "numDay": 3,
        "numReports": 4,
        "configuration": 
        {
            "shouldSkipQuiz": false,
            "hasSnippets": true,
            "selectSnippets": true,
            "selectSnippetStages": false,
            "groomingProbability": 0.6,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 65
        },
        "narrationNodes": 
        [
            {"text": "Buenas. ¿Cómo va todo?", "goTo": -1, 
                "options":[
                    {"text": "Bien, ya me voy adaptando.", "goTo": 3},
                    {"text": "Un poco así asá.", "goTo": 2}
                ]
            },
            {"text": "Bueno, no te preocupes. Poco a poco lo irás pillando todo.", "goTo": 3},
            {"text": "Como ayer nos enfocamos en los acosadores, hoy te daré un poco de información sobre las víctimas.", "goTo": 4},
            {"text": "Según tú, las víctimas son:", "goTo": -1, 
                "options":[
                    {"text": "Solo chicas.", "goTo": 5},
                    {"text": "Solo chicos.", "goTo": 5},
                    {"text": "Tanto chicas como chicos.", "goTo": 6}
                ]
            },
            {"text": "Pues no. Pueden ser tanto chicos como chicas, de la misma manera que los groomers pueden ser hombres o mujeres.", "goTo": 7},
            {"text": "¡Correcto! Del mismo modo, los groomers pueden ser hombres o mujeres.", "goTo": 7},
            {"text": "Algunos factores que influyen en la propensidad a ser víctimas de grooming son los problemas para relacionarse con su família y compañeros de edad, o una actitud que muestre que se está dispuesto a tomar riesgos en Internet.", "goTo": 8},
            {"text": "También suelen ser víctimas los chicos que dudan de su sexualidad, y menores con problemas de salud mental.", "goTo": 9},
            {"text": "Pero bueno, que me voy por las ramas.", "goTo": 10},
            {"text": "Hoy aumentaremos la dificultad de tus tareas un poco.", "goTo": 11},
            {"text": "Aparte de marcar el informe como grooming o no, tendrás que indicar entre los extractos de chats los que son indicios de grooming.", "goTo": 12},
            {"text": "Ya sabes qué buscar: énfasis en el secretismo de la relación, preguntas sobre la relación con los padres, etc. ¿Listo?", "goTo": -1,
                "options":[
                    {"text": "Listo.", "goTo": 13}
                ]
            },
            {"text": "Pues ale. ¡Comenzamos!", "goTo": -1}
        ]
    },
    {
        "numDay": 4,
        "numReports": 4,
        "configuration": 
        {
            "shouldSkipQuiz": false,
            "hasSnippets": true,
            "selectSnippets": true,
            "selectSnippetStages": true,
            "groomingProbability": 0.75,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 65
        },
        "narrationNodes": 
        [
            {"text": "Buenos días. Ya en nada acabamos con la formación. ¿Emocionado? Seguro que sí.", "goTo": 2},
            {"text": "Hoy volveremos a subir la dificultad de los informes.", "goTo": 3},
            {"text": "Además de marcar los fragmentos de chats que son indicios de grooming, también tendrás que indicar a qué fase corresponden.", "goTo": -1,
                "options":[
                    {"text": "Pero si eso no me lo has explicado aún.", "goTo": 4}
                ]
            },
            {"text": "Traaaanqui, a eso iba.", "goTo": 5},
            {"text": "Hay que recalcar que las llamamos fases, pero no necesariamente se dan en orden. Es más para englobar ciertos comportamientos comunes en los groomers.", "goTo": 6},
            {"text": "Definimos 7 fases. No las verás todas en los informes, pero igualmente te puedo preguntar sobre ellas al final del día, así que presta atención. ¿Entendido?", "goTo": -1,
                "options":[
                    {"text": "Entendido.", "goTo": 7}
                ]    
            },
            {"text": "Agrupamos la 1a y la 2a por su similitud en 'Comienzo de la amistad y relación'.", "goTo": 8},
            {"text": "En este período el acosador intenta averiguar qué tan vulnerable es el menor, preguntándole sobre la relación con sus compañeros en la escuela, en casa...", "goTo": 9},
            {"text": "Buscan saber si el menor tiene una red de apoyo, o si por contra se siente solo o incomprendido.", "goTo": 10},
            {"text": "La 3a fase la llamamos 'Evaluación de riesgo'.", "goTo": 11},
            {"text": "Aquí el groomer intenta saber si, en caso de entablar una 'relación' con el menor, haría la posibilidad de ser descubierto.", "goTo": 12},
            {"text": "Por ejemplo, el acosador puede hacer preguntas sobre el dispositivo que utiliza para comunicarse por chat.", "goTo": 13},
            {"text": "También si ese dispositivo es compartido entre miembros de la família, si se lo revisa su tutor, o si está en algún sitio visible como el comedor.", "goTo": 14},
            {"text": "La 4a fase, 'Fase de exclusividad', es donde el acosador se gana a la víctima y formar una relación romántica con el menor.", "goTo": 15},
            {"text": "En esta fase, los groomers se intentan mostrar como una persona de confianza, a la que el menor le puede contar cualquier cosa.", "goTo": 16},
            {"text": "Una vez el 'noviazgo' ha comenzado, el acosador se muestra muy cariñoso con la víctima. Como una pareja, vaya.", "goTo": 17},
            {"text": "De momento todo bien, ¿o te lo repito?", "goTo": -1,
                "options":[
                    {"text": "Todo bien, continúa.", "goTo": 20},
                    {"text": "Repíte, por favor.", "goTo": 18}
                ]    
            },
            {"text": "Claro, sin problema.", "goTo": 19},
            {"text": "Como te decía, hay 7 fases.", "goTo": 7},
            {"text": "En la 5a fase, 'Fase sexual', el groomer comienza a introducir temas sexuales al menor, de manera más o menos sutil.", "goTo": 21},
            {"text": "Esto lo puede hacer preguntando por la sexualidad del menor o haciendo comentarios subidos de tono, por ejemplo.", "goTo": 22},
            {"text": "Luego tenemos la 6a fase, a la que llamamos 'Reproducción de fantasías'.", "goTo": 23},
            {"text": "En esta fase el acosador y el menor recrean una fantasía sexual por mensaje. Dicha recreación puede también incluir el intercambio de fotos indebidas.", "goTo": 24},
            {"text": "Finalmente, en la 7a fase, 'Mitigación de daños', el acosador se intenta asegurar de que la víctima no le contará a nadie de su relación.", "goTo": 25},
            {"text": "Esto incluye elogios por manetener la relación en secreto, insistencia en el secretismo e incluso amenazas, en caso de tener fotos del menor.", "goTo": 26},
            {"text": "Se ha entendido todo?", "goTo": -1,
                "options":[
                    {"text": "Sí, lo tengo todo claro.", "goTo": 28},
                    {"text": "No todo. ¿Me lo repites?", "goTo": 27}
                ]    
            },
            {"text": "Sin problema. ¿Desde el principio, o a desde la fase 5?", "goTo": -1,
                "options":[
                    {"text": "Desde el principio", "goTo": 7},
                    {"text": "Comienza desde la fase 5.", "goTo": 20}
                ]    
            },
            {"text": "¡Perfecto! En los informes no apareceran ni la 'Fase sexual' ni la 'Reproducción de fantasías', pero el resto sí.", "goTo": 29},
            {"text": "Además, también habrán extractos donde habrá que marcar que el acosador está pidiendo fotos indebidas.", "goTo": 30}, 
            {"text": "Como dato, puedes cambiar tu selección cuando quieras. Para marcar rápidamente un extracto como normal, simplemente haz click derecho.", "goTo": 31},
            {"text": "Por último, no podrás marcar un informe como 'normal' si tienes algún extracto marcado.", "goTo": 32},
            {"text": "En fin, ¡A ello!", "goTo": -1}
        ]
    },
    {
        "numDay": 5,
        "numReports": 5,
        "configuration": 
        {
            "shouldSkipQuiz": false,
            "hasSnippets": true,
            "selectSnippets": true,
            "selectSnippetStages": true,
            "groomingProbability": 0.6,
            "minAgeGroomer": 22,
            "maxAgeGroomer": 65
        },
        "narrationNodes": 
        [
            {"text": "¡Buenas! ¡Hoy es tu último día de formación!", "goTo": 2},
            {"text": "Ayer ya te conté lo último que tenías que saber. Hoy lo pondremos a prueba.", "goTo": 3},
            {"text": "Misma mecánica que la de ayer: marcar los fragmentos de chats sospechosos, e indicar la fase.", "goTo": 4},
            {"text": "¿Necesitas que te vuelva a explicar las fases?", "goTo": -1,
                "options":[
                    {"text": "No, no hace falta", "goTo": 19},
                    {"text": "Sí, por favor.", "goTo": 5}
                ]    
            },
            {"text": "Vale, esta vez te las resumiré un poco.", "goTo": 6},
            {"text": "Las dos primeras fases las juntamos en 'Comienzo de la amistad y relación'.", "goTo": 7},
            {"text": "El acosador intentará averiguar si el menor tiene una red de apoyo (família, amigos) o está o se siente solo.", "goTo": 8},
            {"text": "3a fase: 'Evaluación de riesgo'.", "goTo": 9},
            {"text": "Aquí el groomer intenta saber qué tan probable es que lo pillen en caso de comenzar una 'relación' con el menor.", "goTo": 10},
            {"text": "4a fase: 'Fase de exclusividad'.", "goTo": 11},
            {"text": "En esta fase el acosador o bien se intenta mostrar como alguien a quien contarle sus problemas, o ya ha comenzado su relación con el menor y actúa como su pareja.", "goTo": 12},
            {"text": "5a fase: 'Fase sexual', donde el groomer comienza a introducir temas sexuales en las conversaciones que tiene con el menor.", "goTo": 13},
            {"text": "6a fase: 'Reproducción de fantasías'.", "goTo": 14},
            {"text": "Aquí el acosador y el menor reproducen fantasías sexuales, y puede que intercambien fotos subidas de tono.", "goTo": 15},
            {"text": "7a y última fase: 'Mitigación de daños'.", "goTo": 16},
            {"text": "El acosador intentará manipular a la víctima para que mantenga su relación en secreto. Puede ser sutilmente, o a base de amenazas.", "goTo": 17},
            {"text": "Te recuerdo que, aunque numeremos las fases, no es algo que suceda de manera lineal. Algunos groomers se saltan fases, o las hacen en diferente orden", "goTo": 18},
            {"text": "¿Entendido o repito?", "goTo": -1,
                "options":[
                    {"text": "Vale, lo he pillado.", "goTo": 19},
                    {"text": "Repite, por favor.", "goTo": 6}
                ]    
            },
            {"text": "Pues ale. ¡A trabajar!.", "goTo": -1}
        ]
    }
]